zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 155C, Queue 2 Requ. Timer Status Reg., Group 4 */
#define EVADC_G4_Q2_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002155Cu)
/** Alias (User Manual Name) for EVADC_G4_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G4_Q2_REQTS.
*/
#define EVADC_G4REQTS2 (EVADC_G4_Q2_REQTS)

/** \brief 1580, Channel Event Flag Register, Group 4 */
#define EVADC_G4_CEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021580u)
/** Alias (User Manual Name) for EVADC_G4_CEFLAG.
* To use register names with standard convension, please use EVADC_G4_CEFLAG.
*/
#define EVADC_G4CEFLAG (EVADC_G4_CEFLAG)

/** \brief 1584, Result Event Flag Register, Group 4 */
#define EVADC_G4_REFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0021584u)
/** Alias (User Manual Name) for EVADC_G4_REFLAG.
* To use register names with standard convension, please use EVADC_G4_REFLAG.
*/
#define EVADC_G4REFLAG (EVADC_G4_REFLAG)

/** \brief 1588, Source Event Flag Register, Group 4 */
#define EVADC_G4_SEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021588u)
/** Alias (User Manual Name) for EVADC_G4_SEFLAG.
* To use register names with standard convension, please use EVADC_G4_SEFLAG.
*/
#define EVADC_G4SEFLAG (EVADC_G4_SEFLAG)

/** \brief 1590, Channel Event Flag Clear Register, Group 4 */
#define EVADC_G4_CEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021590u)
/** Alias (User Manual Name) for EVADC_G4_CEFCLR.
* To use register names with standard convension, please use EVADC_G4_CEFCLR.
*/
#define EVADC_G4CEFCLR (EVADC_G4_CEFCLR)

/** \brief 1594, Result Event Flag Clear Register, Group 4 */
#define EVADC_G4_REFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0021594u)
/** Alias (User Manual Name) for EVADC_G4_REFCLR.
* To use register names with standard convension, please use EVADC_G4_REFCLR.
*/
#define EVADC_G4REFCLR (EVADC_G4_REFCLR)

/** \brief 1598, Source Event Flag Clear Reg., Group 4 */
#define EVADC_G4_SEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021598u)
/** Alias (User Manual Name) for EVADC_G4_SEFCLR.
* To use register names with standard convension, please use EVADC_G4_SEFCLR.
*/
#define EVADC_G4SEFCLR (EVADC_G4_SEFCLR)

/** \brief 15A0, Channel Event Node Pointer Reg. 0, Group 4 */
#define EVADC_G4_CEVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00215A0u)
/** Alias (User Manual Name) for EVADC_G4_CEVNP0.
* To use register names with standard convension, please use EVADC_G4_CEVNP0.
*/
#define EVADC_G4CEVNP0 (EVADC_G4_CEVNP0)

/** \brief 15A4, Channel Event Node Pointer Reg. 1, Group 4 */
#define EVADC_G4_CEVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP1*)0xF00215A4u)
/** Alias (User Manual Name) for EVADC_G4_CEVNP1.
* To use register names with standard convension, please use EVADC_G4_CEVNP1.
*/
#define EVADC_G4CEVNP1 (EVADC_G4_CEVNP1)

/** \brief 15B0, Result Event Node Pointer Reg. 0, Group 4 */
#define EVADC_G4_REVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00215B0u)
/** Alias (User Manual Name) for EVADC_G4_REVNP0.
* To use register names with standard convension, please use EVADC_G4_REVNP0.
*/
#define EVADC_G4REVNP0 (EVADC_G4_REVNP0)

/** \brief 15B4, Result Event Node Pointer Reg. 1, Group 4 */
#define EVADC_G4_REVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00215B4u)
/** Alias (User Manual Name) for EVADC_G4_REVNP1.
* To use register names with standard convension, please use EVADC_G4_REVNP1.
*/
#define EVADC_G4REVNP1 (EVADC_G4_REVNP1)

/** \brief 15C0, Source Event Node Pointer Reg., Group 4 */
#define EVADC_G4_SEVNP /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00215C0u)
/** Alias (User Manual Name) for EVADC_G4_SEVNP.
* To use register names with standard convension, please use EVADC_G4_SEVNP.
*/
#define EVADC_G4SEVNP (EVADC_G4_SEVNP)

/** \brief 15C8, Service Request Software Activation Trigger, Group 4 */
#define EVADC_G4_SRACT /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00215C8u)
/** Alias (User Manual Name) for EVADC_G4_SRACT.
* To use register names with standard convension, please use EVADC_G4_SRACT.
*/
#define EVADC_G4SRACT (EVADC_G4_SRACT)

/** \brief 15F0, External Multiplexer Control Reg., Group 4 */
#define EVADC_G4_EMUXCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00215F0u)
/** Alias (User Manual Name) for EVADC_G4_EMUXCTR.
* To use register names with standard convension, please use EVADC_G4_EMUXCTR.
*/
#define EVADC_G4EMUXCTR (EVADC_G4_EMUXCTR)

/** \brief 15F4, Ext. Multiplexer Channel Select Reg., Group 4 */
#define EVADC_G4_EMUXCS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00215F4u)
/** Alias (User Manual Name) for EVADC_G4_EMUXCS.
* To use register names with standard convension, please use EVADC_G4_EMUXCS.
*/
#define EVADC_G4EMUXCS (EVADC_G4_EMUXCS)

/** \brief 15F8, Valid Flag Register, Group 4 */
#define EVADC_G4_VFR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00215F8u)
/** Alias (User Manual Name) for EVADC_G4_VFR.
* To use register names with standard convension, please use EVADC_G4_VFR.
*/
#define EVADC_G4VFR (EVADC_G4_VFR)

/** \brief 1600, Group 4, Channel 0 Control Register */
#define EVADC_G4_CHCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021600u)
/** Alias (User Manual Name) for EVADC_G4_CHCTR0.
* To use register names with standard convension, please use EVADC_G4_CHCTR0.
*/
#define EVADC_G4CHCTR0 (EVADC_G4_CHCTR0)

/** \brief 1604, Group 4, Channel 1 Control Register */
#define EVADC_G4_CHCTR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021604u)
/** Alias (User Manual Name) for EVADC_G4_CHCTR1.
* To use register names with standard convension, please use EVADC_G4_CHCTR1.
*/
#define EVADC_G4CHCTR1 (EVADC_G4_CHCTR1)

/** \brief 1608, Group 4, Channel 2 Control Register */
#define EVADC_G4_CHCTR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021608u)
/** Alias (User Manual Name) for EVADC_G4_CHCTR2.
* To use register names with standard convension, please use EVADC_G4_CHCTR2.
*/
#define EVADC_G4CHCTR2 (EVADC_G4_CHCTR2)

/** \brief 160C, Group 4, Channel 3 Control Register */
#define EVADC_G4_CHCTR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002160Cu)
/** Alias (User Manual Name) for EVADC_G4_CHCTR3.
* To use register names with standard convension, please use EVADC_G4_CHCTR3.
*/
#define EVADC_G4CHCTR3 (EVADC_G4_CHCTR3)

/** \brief 1610, Group 4, Channel 4 Control Register */
#define EVADC_G4_CHCTR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021610u)
/** Alias (User Manual Name) for EVADC_G4_CHCTR4.
* To use register names with standard convension, please use EVADC_G4_CHCTR4.
*/
#define EVADC_G4CHCTR4 (EVADC_G4_CHCTR4)

/** \brief 1614, Group 4, Channel 5 Control Register */
#define EVADC_G4_CHCTR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021614u)
/** Alias (User Manual Name) for EVADC_G4_CHCTR5.
* To use register names with standard convension, please use EVADC_G4_CHCTR5.
*/
#define EVADC_G4CHCTR5 (EVADC_G4_CHCTR5)

/** \brief 1618, Group 4, Channel 6 Control Register */
#define EVADC_G4_CHCTR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021618u)
/** Alias (User Manual Name) for EVADC_G4_CHCTR6.
* To use register names with standard convension, please use EVADC_G4_CHCTR6.
*/
#define EVADC_G4CHCTR6 (EVADC_G4_CHCTR6)

/** \brief 161C, Group 4, Channel 7 Control Register */
#define EVADC_G4_CHCTR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002161Cu)
/** Alias (User Manual Name) for EVADC_G4_CHCTR7.
* To use register names with standard convension, please use EVADC_G4_CHCTR7.
*/
#define EVADC_G4CHCTR7 (EVADC_G4_CHCTR7)

/** \brief 1680, Group 4 Result Control Register 0 */
#define EVADC_G4_RCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021680u)
/** Alias (User Manual Name) for EVADC_G4_RCR0.
* To use register names with standard convension, please use EVADC_G4_RCR0.
*/
#define EVADC_G4RCR0 (EVADC_G4_RCR0)

/** \brief 1684, Group 4 Result Control Register 1 */
#define EVADC_G4_RCR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021684u)
/** Alias (User Manual Name) for EVADC_G4_RCR1.
* To use register names with standard convension, please use EVADC_G4_RCR1.
*/
#define EVADC_G4RCR1 (EVADC_G4_RCR1)

/** \brief 1688, Group 4 Result Control Register 2 */
#define EVADC_G4_RCR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021688u)
/** Alias (User Manual Name) for EVADC_G4_RCR2.
* To use register names with standard convension, please use EVADC_G4_RCR2.
*/
#define EVADC_G4RCR2 (EVADC_G4_RCR2)

