zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 192C, Queue 1 Register 0, Group 5 */
#define EVADC_G5_Q1_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002192Cu)
/** Alias (User Manual Name) for EVADC_G5_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G5_Q1_Q0R.
*/
#define EVADC_G5Q0R1 (EVADC_G5_Q1_Q0R)

/** \brief 1930, Queue 1 Input Register, Group 5 */
#define EVADC_G5_Q1_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021930u)
/** Alias (User Manual Name) for EVADC_G5_Q1_QINR.
* To use register names with standard convension, please use EVADC_G5_Q1_QINR.
*/
#define EVADC_G5QINR1 (EVADC_G5_Q1_QINR)

/** \brief 1934, Queue 1 Backup Register, Group 5 */
#define EVADC_G5_Q1_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021934u)
/** Alias (User Manual Name) for EVADC_G5_Q1_QBUR.
* To use register names with standard convension, please use EVADC_G5_Q1_QBUR.
*/
#define EVADC_G5QBUR1 (EVADC_G5_Q1_QBUR)

/** \brief 1938, Queue 1 Requ. Timer Mode Reg., Group 5 */
#define EVADC_G5_Q1_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021938u)
/** Alias (User Manual Name) for EVADC_G5_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G5_Q1_REQTM.
*/
#define EVADC_G5REQTM1 (EVADC_G5_Q1_REQTM)

/** \brief 193C, Queue 1 Requ. Timer Status Reg., Group 5 */
#define EVADC_G5_Q1_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002193Cu)
/** Alias (User Manual Name) for EVADC_G5_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G5_Q1_REQTS.
*/
#define EVADC_G5REQTS1 (EVADC_G5_Q1_REQTS)

/** \brief 1940, Queue 2 Source Contr. Register, Group 5 */
#define EVADC_G5_Q2_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021940u)
/** Alias (User Manual Name) for EVADC_G5_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G5_Q2_QCTRL.
*/
#define EVADC_G5QCTRL2 (EVADC_G5_Q2_QCTRL)

/** \brief 1944, Queue 2 Mode Register, Group 5 */
#define EVADC_G5_Q2_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021944u)
/** Alias (User Manual Name) for EVADC_G5_Q2_QMR.
* To use register names with standard convension, please use EVADC_G5_Q2_QMR.
*/
#define EVADC_G5QMR2 (EVADC_G5_Q2_QMR)

/** \brief 1948, Queue 2 Status Register, Group 5 */
#define EVADC_G5_Q2_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021948u)
/** Alias (User Manual Name) for EVADC_G5_Q2_QSR.
* To use register names with standard convension, please use EVADC_G5_Q2_QSR.
*/
#define EVADC_G5QSR2 (EVADC_G5_Q2_QSR)

/** \brief 194C, Queue 2 Register 0, Group 5 */
#define EVADC_G5_Q2_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002194Cu)
/** Alias (User Manual Name) for EVADC_G5_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G5_Q2_Q0R.
*/
#define EVADC_G5Q0R2 (EVADC_G5_Q2_Q0R)

/** \brief 1950, Queue 2 Input Register, Group 5 */
#define EVADC_G5_Q2_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021950u)
/** Alias (User Manual Name) for EVADC_G5_Q2_QINR.
* To use register names with standard convension, please use EVADC_G5_Q2_QINR.
*/
#define EVADC_G5QINR2 (EVADC_G5_Q2_QINR)

/** \brief 1954, Queue 2 Backup Register, Group 5 */
#define EVADC_G5_Q2_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021954u)
/** Alias (User Manual Name) for EVADC_G5_Q2_QBUR.
* To use register names with standard convension, please use EVADC_G5_Q2_QBUR.
*/
#define EVADC_G5QBUR2 (EVADC_G5_Q2_QBUR)

/** \brief 1958, Queue 2 Requ. Timer Mode Reg., Group 5 */
#define EVADC_G5_Q2_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021958u)
/** Alias (User Manual Name) for EVADC_G5_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G5_Q2_REQTM.
*/
#define EVADC_G5REQTM2 (EVADC_G5_Q2_REQTM)

/** \brief 195C, Queue 2 Requ. Timer Status Reg., Group 5 */
#define EVADC_G5_Q2_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002195Cu)
/** Alias (User Manual Name) for EVADC_G5_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G5_Q2_REQTS.
*/
#define EVADC_G5REQTS2 (EVADC_G5_Q2_REQTS)

/** \brief 1980, Channel Event Flag Register, Group 5 */
#define EVADC_G5_CEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021980u)
/** Alias (User Manual Name) for EVADC_G5_CEFLAG.
* To use register names with standard convension, please use EVADC_G5_CEFLAG.
*/
#define EVADC_G5CEFLAG (EVADC_G5_CEFLAG)

/** \brief 1984, Result Event Flag Register, Group 5 */
#define EVADC_G5_REFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0021984u)
/** Alias (User Manual Name) for EVADC_G5_REFLAG.
* To use register names with standard convension, please use EVADC_G5_REFLAG.
*/
#define EVADC_G5REFLAG (EVADC_G5_REFLAG)

/** \brief 1988, Source Event Flag Register, Group 5 */
#define EVADC_G5_SEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021988u)
/** Alias (User Manual Name) for EVADC_G5_SEFLAG.
* To use register names with standard convension, please use EVADC_G5_SEFLAG.
*/
#define EVADC_G5SEFLAG (EVADC_G5_SEFLAG)

/** \brief 1990, Channel Event Flag Clear Register, Group 5 */
#define EVADC_G5_CEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021990u)
/** Alias (User Manual Name) for EVADC_G5_CEFCLR.
* To use register names with standard convension, please use EVADC_G5_CEFCLR.
*/
#define EVADC_G5CEFCLR (EVADC_G5_CEFCLR)

/** \brief 1994, Result Event Flag Clear Register, Group 5 */
#define EVADC_G5_REFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0021994u)
/** Alias (User Manual Name) for EVADC_G5_REFCLR.
* To use register names with standard convension, please use EVADC_G5_REFCLR.
*/
#define EVADC_G5REFCLR (EVADC_G5_REFCLR)

/** \brief 1998, Source Event Flag Clear Reg., Group 5 */
#define EVADC_G5_SEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021998u)
/** Alias (User Manual Name) for EVADC_G5_SEFCLR.
* To use register names with standard convension, please use EVADC_G5_SEFCLR.
*/
#define EVADC_G5SEFCLR (EVADC_G5_SEFCLR)

/** \brief 19A0, Channel Event Node Pointer Reg. 0, Group 5 */
#define EVADC_G5_CEVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00219A0u)
/** Alias (User Manual Name) for EVADC_G5_CEVNP0.
* To use register names with standard convension, please use EVADC_G5_CEVNP0.
*/
#define EVADC_G5CEVNP0 (EVADC_G5_CEVNP0)

/** \brief 19A4, Channel Event Node Pointer Reg. 1, Group 5 */
#define EVADC_G5_CEVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP1*)0xF00219A4u)
/** Alias (User Manual Name) for EVADC_G5_CEVNP1.
* To use register names with standard convension, please use EVADC_G5_CEVNP1.
*/
#define EVADC_G5CEVNP1 (EVADC_G5_CEVNP1)

