zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 19B0, Result Event Node Pointer Reg. 0, Group 5 */
#define EVADC_G5_REVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00219B0u)
/** Alias (User Manual Name) for EVADC_G5_REVNP0.
* To use register names with standard convension, please use EVADC_G5_REVNP0.
*/
#define EVADC_G5REVNP0 (EVADC_G5_REVNP0)

/** \brief 19B4, Result Event Node Pointer Reg. 1, Group 5 */
#define EVADC_G5_REVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00219B4u)
/** Alias (User Manual Name) for EVADC_G5_REVNP1.
* To use register names with standard convension, please use EVADC_G5_REVNP1.
*/
#define EVADC_G5REVNP1 (EVADC_G5_REVNP1)

/** \brief 19C0, Source Event Node Pointer Reg., Group 5 */
#define EVADC_G5_SEVNP /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00219C0u)
/** Alias (User Manual Name) for EVADC_G5_SEVNP.
* To use register names with standard convension, please use EVADC_G5_SEVNP.
*/
#define EVADC_G5SEVNP (EVADC_G5_SEVNP)

/** \brief 19C8, Service Request Software Activation Trigger, Group 5 */
#define EVADC_G5_SRACT /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00219C8u)
/** Alias (User Manual Name) for EVADC_G5_SRACT.
* To use register names with standard convension, please use EVADC_G5_SRACT.
*/
#define EVADC_G5SRACT (EVADC_G5_SRACT)

/** \brief 19F0, External Multiplexer Control Reg., Group 5 */
#define EVADC_G5_EMUXCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00219F0u)
/** Alias (User Manual Name) for EVADC_G5_EMUXCTR.
* To use register names with standard convension, please use EVADC_G5_EMUXCTR.
*/
#define EVADC_G5EMUXCTR (EVADC_G5_EMUXCTR)

/** \brief 19F4, Ext. Multiplexer Channel Select Reg., Group 5 */
#define EVADC_G5_EMUXCS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00219F4u)
/** Alias (User Manual Name) for EVADC_G5_EMUXCS.
* To use register names with standard convension, please use EVADC_G5_EMUXCS.
*/
#define EVADC_G5EMUXCS (EVADC_G5_EMUXCS)

/** \brief 19F8, Valid Flag Register, Group 5 */
#define EVADC_G5_VFR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00219F8u)
/** Alias (User Manual Name) for EVADC_G5_VFR.
* To use register names with standard convension, please use EVADC_G5_VFR.
*/
#define EVADC_G5VFR (EVADC_G5_VFR)

/** \brief 1A00, Group 5, Channel 0 Control Register */
#define EVADC_G5_CHCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A00u)
/** Alias (User Manual Name) for EVADC_G5_CHCTR0.
* To use register names with standard convension, please use EVADC_G5_CHCTR0.
*/
#define EVADC_G5CHCTR0 (EVADC_G5_CHCTR0)

/** \brief 1A04, Group 5, Channel 1 Control Register */
#define EVADC_G5_CHCTR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A04u)
/** Alias (User Manual Name) for EVADC_G5_CHCTR1.
* To use register names with standard convension, please use EVADC_G5_CHCTR1.
*/
#define EVADC_G5CHCTR1 (EVADC_G5_CHCTR1)

/** \brief 1A08, Group 5, Channel 2 Control Register */
#define EVADC_G5_CHCTR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A08u)
/** Alias (User Manual Name) for EVADC_G5_CHCTR2.
* To use register names with standard convension, please use EVADC_G5_CHCTR2.
*/
#define EVADC_G5CHCTR2 (EVADC_G5_CHCTR2)

/** \brief 1A0C, Group 5, Channel 3 Control Register */
#define EVADC_G5_CHCTR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A0Cu)
/** Alias (User Manual Name) for EVADC_G5_CHCTR3.
* To use register names with standard convension, please use EVADC_G5_CHCTR3.
*/
#define EVADC_G5CHCTR3 (EVADC_G5_CHCTR3)

/** \brief 1A10, Group 5, Channel 4 Control Register */
#define EVADC_G5_CHCTR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A10u)
/** Alias (User Manual Name) for EVADC_G5_CHCTR4.
* To use register names with standard convension, please use EVADC_G5_CHCTR4.
*/
#define EVADC_G5CHCTR4 (EVADC_G5_CHCTR4)

/** \brief 1A14, Group 5, Channel 5 Control Register */
#define EVADC_G5_CHCTR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A14u)
/** Alias (User Manual Name) for EVADC_G5_CHCTR5.
* To use register names with standard convension, please use EVADC_G5_CHCTR5.
*/
#define EVADC_G5CHCTR5 (EVADC_G5_CHCTR5)

/** \brief 1A18, Group 5, Channel 6 Control Register */
#define EVADC_G5_CHCTR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A18u)
/** Alias (User Manual Name) for EVADC_G5_CHCTR6.
* To use register names with standard convension, please use EVADC_G5_CHCTR6.
*/
#define EVADC_G5CHCTR6 (EVADC_G5_CHCTR6)

/** \brief 1A1C, Group 5, Channel 7 Control Register */
#define EVADC_G5_CHCTR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021A1Cu)
/** Alias (User Manual Name) for EVADC_G5_CHCTR7.
* To use register names with standard convension, please use EVADC_G5_CHCTR7.
*/
#define EVADC_G5CHCTR7 (EVADC_G5_CHCTR7)

/** \brief 1A80, Group 5 Result Control Register 0 */
#define EVADC_G5_RCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A80u)
/** Alias (User Manual Name) for EVADC_G5_RCR0.
* To use register names with standard convension, please use EVADC_G5_RCR0.
*/
#define EVADC_G5RCR0 (EVADC_G5_RCR0)

/** \brief 1A84, Group 5 Result Control Register 1 */
#define EVADC_G5_RCR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A84u)
/** Alias (User Manual Name) for EVADC_G5_RCR1.
* To use register names with standard convension, please use EVADC_G5_RCR1.
*/
#define EVADC_G5RCR1 (EVADC_G5_RCR1)

/** \brief 1A88, Group 5 Result Control Register 2 */
#define EVADC_G5_RCR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A88u)
/** Alias (User Manual Name) for EVADC_G5_RCR2.
* To use register names with standard convension, please use EVADC_G5_RCR2.
*/
#define EVADC_G5RCR2 (EVADC_G5_RCR2)

/** \brief 1A8C, Group 5 Result Control Register 3 */
#define EVADC_G5_RCR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A8Cu)
/** Alias (User Manual Name) for EVADC_G5_RCR3.
* To use register names with standard convension, please use EVADC_G5_RCR3.
*/
#define EVADC_G5RCR3 (EVADC_G5_RCR3)

/** \brief 1A90, Group 5 Result Control Register 4 */
#define EVADC_G5_RCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A90u)
/** Alias (User Manual Name) for EVADC_G5_RCR4.
* To use register names with standard convension, please use EVADC_G5_RCR4.
*/
#define EVADC_G5RCR4 (EVADC_G5_RCR4)

/** \brief 1A94, Group 5 Result Control Register 5 */
#define EVADC_G5_RCR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A94u)
/** Alias (User Manual Name) for EVADC_G5_RCR5.
* To use register names with standard convension, please use EVADC_G5_RCR5.
*/
#define EVADC_G5RCR5 (EVADC_G5_RCR5)

/** \brief 1A98, Group 5 Result Control Register 6 */
#define EVADC_G5_RCR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A98u)
/** Alias (User Manual Name) for EVADC_G5_RCR6.
* To use register names with standard convension, please use EVADC_G5_RCR6.
*/
#define EVADC_G5RCR6 (EVADC_G5_RCR6)

/** \brief 1A9C, Group 5 Result Control Register 7 */
#define EVADC_G5_RCR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021A9Cu)
/** Alias (User Manual Name) for EVADC_G5_RCR7.
* To use register names with standard convension, please use EVADC_G5_RCR7.
*/
#define EVADC_G5RCR7 (EVADC_G5_RCR7)

