zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 20A0, Input Class Register 0, Group 7 */
#define EVADC_G7_ICLASS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00220A0u)
/** Alias (User Manual Name) for EVADC_G7_ICLASS0.
* To use register names with standard convension, please use EVADC_G7_ICLASS0.
*/
#define EVADC_G7ICLASS0 (EVADC_G7_ICLASS0)

/** \brief 20A4, Input Class Register 1, Group 7 */
#define EVADC_G7_ICLASS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00220A4u)
/** Alias (User Manual Name) for EVADC_G7_ICLASS1.
* To use register names with standard convension, please use EVADC_G7_ICLASS1.
*/
#define EVADC_G7ICLASS1 (EVADC_G7_ICLASS1)

/** \brief 20B0, Alias Register, Group 7 */
#define EVADC_G7_ALIAS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00220B0u)
/** Alias (User Manual Name) for EVADC_G7_ALIAS.
* To use register names with standard convension, please use EVADC_G7_ALIAS.
*/
#define EVADC_G7ALIAS (EVADC_G7_ALIAS)

/** \brief 20B8, Boundary Select Register, Group 7 */
#define EVADC_G7_BOUND /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00220B8u)
/** Alias (User Manual Name) for EVADC_G7_BOUND.
* To use register names with standard convension, please use EVADC_G7_BOUND.
*/
#define EVADC_G7BOUND (EVADC_G7_BOUND)

/** \brief 20C0, Synchronization Control Register, Group 7 */
#define EVADC_G7_SYNCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00220C0u)
/** Alias (User Manual Name) for EVADC_G7_SYNCTR.
* To use register names with standard convension, please use EVADC_G7_SYNCTR.
*/
#define EVADC_G7SYNCTR (EVADC_G7_SYNCTR)

/** \brief 2100, Queue 0 Source Contr. Register, Group 7 */
#define EVADC_G7_Q0_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022100u)
/** Alias (User Manual Name) for EVADC_G7_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G7_Q0_QCTRL.
*/
#define EVADC_G7QCTRL0 (EVADC_G7_Q0_QCTRL)

/** \brief 2104, Queue 0 Mode Register, Group 7 */
#define EVADC_G7_Q0_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022104u)
/** Alias (User Manual Name) for EVADC_G7_Q0_QMR.
* To use register names with standard convension, please use EVADC_G7_Q0_QMR.
*/
#define EVADC_G7QMR0 (EVADC_G7_Q0_QMR)

/** \brief 2108, Queue 0 Status Register, Group 7 */
#define EVADC_G7_Q0_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022108u)
/** Alias (User Manual Name) for EVADC_G7_Q0_QSR.
* To use register names with standard convension, please use EVADC_G7_Q0_QSR.
*/
#define EVADC_G7QSR0 (EVADC_G7_Q0_QSR)

/** \brief 210C, Queue 0 Register 0, Group 7 */
#define EVADC_G7_Q0_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002210Cu)
/** Alias (User Manual Name) for EVADC_G7_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G7_Q0_Q0R.
*/
#define EVADC_G7Q0R0 (EVADC_G7_Q0_Q0R)

/** \brief 2110, Queue 0 Input Register, Group 7 */
#define EVADC_G7_Q0_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022110u)
/** Alias (User Manual Name) for EVADC_G7_Q0_QINR.
* To use register names with standard convension, please use EVADC_G7_Q0_QINR.
*/
#define EVADC_G7QINR0 (EVADC_G7_Q0_QINR)

/** \brief 2114, Queue 0 Backup Register, Group 7 */
#define EVADC_G7_Q0_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0022114u)
/** Alias (User Manual Name) for EVADC_G7_Q0_QBUR.
* To use register names with standard convension, please use EVADC_G7_Q0_QBUR.
*/
#define EVADC_G7QBUR0 (EVADC_G7_Q0_QBUR)

/** \brief 2118, Queue 0 Requ. Timer Mode Reg., Group 7 */
#define EVADC_G7_Q0_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022118u)
/** Alias (User Manual Name) for EVADC_G7_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G7_Q0_REQTM.
*/
#define EVADC_G7REQTM0 (EVADC_G7_Q0_REQTM)

/** \brief 211C, Queue 0 Requ. Timer Status Reg., Group 7 */
#define EVADC_G7_Q0_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002211Cu)
/** Alias (User Manual Name) for EVADC_G7_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G7_Q0_REQTS.
*/
#define EVADC_G7REQTS0 (EVADC_G7_Q0_REQTS)

/** \brief 2120, Queue 1 Source Contr. Register, Group 7 */
#define EVADC_G7_Q1_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022120u)
/** Alias (User Manual Name) for EVADC_G7_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G7_Q1_QCTRL.
*/
#define EVADC_G7QCTRL1 (EVADC_G7_Q1_QCTRL)

/** \brief 2124, Queue 1 Mode Register, Group 7 */
#define EVADC_G7_Q1_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022124u)
/** Alias (User Manual Name) for EVADC_G7_Q1_QMR.
* To use register names with standard convension, please use EVADC_G7_Q1_QMR.
*/
#define EVADC_G7QMR1 (EVADC_G7_Q1_QMR)

/** \brief 2128, Queue 1 Status Register, Group 7 */
#define EVADC_G7_Q1_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022128u)
/** Alias (User Manual Name) for EVADC_G7_Q1_QSR.
* To use register names with standard convension, please use EVADC_G7_Q1_QSR.
*/
#define EVADC_G7QSR1 (EVADC_G7_Q1_QSR)

/** \brief 212C, Queue 1 Register 0, Group 7 */
#define EVADC_G7_Q1_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002212Cu)
/** Alias (User Manual Name) for EVADC_G7_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G7_Q1_Q0R.
*/
#define EVADC_G7Q0R1 (EVADC_G7_Q1_Q0R)

/** \brief 2130, Queue 1 Input Register, Group 7 */
#define EVADC_G7_Q1_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022130u)
/** Alias (User Manual Name) for EVADC_G7_Q1_QINR.
* To use register names with standard convension, please use EVADC_G7_Q1_QINR.
*/
#define EVADC_G7QINR1 (EVADC_G7_Q1_QINR)

/** \brief 2134, Queue 1 Backup Register, Group 7 */
#define EVADC_G7_Q1_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0022134u)
/** Alias (User Manual Name) for EVADC_G7_Q1_QBUR.
* To use register names with standard convension, please use EVADC_G7_Q1_QBUR.
*/
#define EVADC_G7QBUR1 (EVADC_G7_Q1_QBUR)

/** \brief 2138, Queue 1 Requ. Timer Mode Reg., Group 7 */
#define EVADC_G7_Q1_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022138u)
/** Alias (User Manual Name) for EVADC_G7_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G7_Q1_REQTM.
*/
#define EVADC_G7REQTM1 (EVADC_G7_Q1_REQTM)

/** \brief 213C, Queue 1 Requ. Timer Status Reg., Group 7 */
#define EVADC_G7_Q1_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002213Cu)
/** Alias (User Manual Name) for EVADC_G7_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G7_Q1_REQTS.
*/
#define EVADC_G7REQTS1 (EVADC_G7_Q1_REQTS)

/** \brief 2140, Queue 2 Source Contr. Register, Group 7 */
#define EVADC_G7_Q2_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022140u)
/** Alias (User Manual Name) for EVADC_G7_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G7_Q2_QCTRL.
*/
#define EVADC_G7QCTRL2 (EVADC_G7_Q2_QCTRL)

/** \brief 2144, Queue 2 Mode Register, Group 7 */
#define EVADC_G7_Q2_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022144u)
/** Alias (User Manual Name) for EVADC_G7_Q2_QMR.
* To use register names with standard convension, please use EVADC_G7_Q2_QMR.
*/
#define EVADC_G7QMR2 (EVADC_G7_Q2_QMR)

