zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 2148, Queue 2 Status Register, Group 7 */
#define EVADC_G7_Q2_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022148u)
/** Alias (User Manual Name) for EVADC_G7_Q2_QSR.
* To use register names with standard convension, please use EVADC_G7_Q2_QSR.
*/
#define EVADC_G7QSR2 (EVADC_G7_Q2_QSR)

/** \brief 214C, Queue 2 Register 0, Group 7 */
#define EVADC_G7_Q2_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002214Cu)
/** Alias (User Manual Name) for EVADC_G7_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G7_Q2_Q0R.
*/
#define EVADC_G7Q0R2 (EVADC_G7_Q2_Q0R)

/** \brief 2150, Queue 2 Input Register, Group 7 */
#define EVADC_G7_Q2_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022150u)
/** Alias (User Manual Name) for EVADC_G7_Q2_QINR.
* To use register names with standard convension, please use EVADC_G7_Q2_QINR.
*/
#define EVADC_G7QINR2 (EVADC_G7_Q2_QINR)

/** \brief 2154, Queue 2 Backup Register, Group 7 */
#define EVADC_G7_Q2_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0022154u)
/** Alias (User Manual Name) for EVADC_G7_Q2_QBUR.
* To use register names with standard convension, please use EVADC_G7_Q2_QBUR.
*/
#define EVADC_G7QBUR2 (EVADC_G7_Q2_QBUR)

/** \brief 2158, Queue 2 Requ. Timer Mode Reg., Group 7 */
#define EVADC_G7_Q2_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022158u)
/** Alias (User Manual Name) for EVADC_G7_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G7_Q2_REQTM.
*/
#define EVADC_G7REQTM2 (EVADC_G7_Q2_REQTM)

/** \brief 215C, Queue 2 Requ. Timer Status Reg., Group 7 */
#define EVADC_G7_Q2_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002215Cu)
/** Alias (User Manual Name) for EVADC_G7_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G7_Q2_REQTS.
*/
#define EVADC_G7REQTS2 (EVADC_G7_Q2_REQTS)

/** \brief 2180, Channel Event Flag Register, Group 7 */
#define EVADC_G7_CEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0022180u)
/** Alias (User Manual Name) for EVADC_G7_CEFLAG.
* To use register names with standard convension, please use EVADC_G7_CEFLAG.
*/
#define EVADC_G7CEFLAG (EVADC_G7_CEFLAG)

/** \brief 2184, Result Event Flag Register, Group 7 */
#define EVADC_G7_REFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0022184u)
/** Alias (User Manual Name) for EVADC_G7_REFLAG.
* To use register names with standard convension, please use EVADC_G7_REFLAG.
*/
#define EVADC_G7REFLAG (EVADC_G7_REFLAG)

/** \brief 2188, Source Event Flag Register, Group 7 */
#define EVADC_G7_SEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0022188u)
/** Alias (User Manual Name) for EVADC_G7_SEFLAG.
* To use register names with standard convension, please use EVADC_G7_SEFLAG.
*/
#define EVADC_G7SEFLAG (EVADC_G7_SEFLAG)

/** \brief 2190, Channel Event Flag Clear Register, Group 7 */
#define EVADC_G7_CEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0022190u)
/** Alias (User Manual Name) for EVADC_G7_CEFCLR.
* To use register names with standard convension, please use EVADC_G7_CEFCLR.
*/
#define EVADC_G7CEFCLR (EVADC_G7_CEFCLR)

/** \brief 2194, Result Event Flag Clear Register, Group 7 */
#define EVADC_G7_REFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0022194u)
/** Alias (User Manual Name) for EVADC_G7_REFCLR.
* To use register names with standard convension, please use EVADC_G7_REFCLR.
*/
#define EVADC_G7REFCLR (EVADC_G7_REFCLR)

/** \brief 2198, Source Event Flag Clear Reg., Group 7 */
#define EVADC_G7_SEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0022198u)
/** Alias (User Manual Name) for EVADC_G7_SEFCLR.
* To use register names with standard convension, please use EVADC_G7_SEFCLR.
*/
#define EVADC_G7SEFCLR (EVADC_G7_SEFCLR)

/** \brief 21A0, Channel Event Node Pointer Reg. 0, Group 7 */
#define EVADC_G7_CEVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00221A0u)
/** Alias (User Manual Name) for EVADC_G7_CEVNP0.
* To use register names with standard convension, please use EVADC_G7_CEVNP0.
*/
#define EVADC_G7CEVNP0 (EVADC_G7_CEVNP0)

/** \brief 21A4, Channel Event Node Pointer Reg. 1, Group 7 */
#define EVADC_G7_CEVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP1*)0xF00221A4u)
/** Alias (User Manual Name) for EVADC_G7_CEVNP1.
* To use register names with standard convension, please use EVADC_G7_CEVNP1.
*/
#define EVADC_G7CEVNP1 (EVADC_G7_CEVNP1)

/** \brief 21B0, Result Event Node Pointer Reg. 0, Group 7 */
#define EVADC_G7_REVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00221B0u)
/** Alias (User Manual Name) for EVADC_G7_REVNP0.
* To use register names with standard convension, please use EVADC_G7_REVNP0.
*/
#define EVADC_G7REVNP0 (EVADC_G7_REVNP0)

/** \brief 21B4, Result Event Node Pointer Reg. 1, Group 7 */
#define EVADC_G7_REVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00221B4u)
/** Alias (User Manual Name) for EVADC_G7_REVNP1.
* To use register names with standard convension, please use EVADC_G7_REVNP1.
*/
#define EVADC_G7REVNP1 (EVADC_G7_REVNP1)

/** \brief 21C0, Source Event Node Pointer Reg., Group 7 */
#define EVADC_G7_SEVNP /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00221C0u)
/** Alias (User Manual Name) for EVADC_G7_SEVNP.
* To use register names with standard convension, please use EVADC_G7_SEVNP.
*/
#define EVADC_G7SEVNP (EVADC_G7_SEVNP)

/** \brief 21C8, Service Request Software Activation Trigger, Group 7 */
#define EVADC_G7_SRACT /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00221C8u)
/** Alias (User Manual Name) for EVADC_G7_SRACT.
* To use register names with standard convension, please use EVADC_G7_SRACT.
*/
#define EVADC_G7SRACT (EVADC_G7_SRACT)

/** \brief 21F0, External Multiplexer Control Reg., Group 7 */
#define EVADC_G7_EMUXCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00221F0u)
/** Alias (User Manual Name) for EVADC_G7_EMUXCTR.
* To use register names with standard convension, please use EVADC_G7_EMUXCTR.
*/
#define EVADC_G7EMUXCTR (EVADC_G7_EMUXCTR)

/** \brief 21F4, Ext. Multiplexer Channel Select Reg., Group 7 */
#define EVADC_G7_EMUXCS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00221F4u)
/** Alias (User Manual Name) for EVADC_G7_EMUXCS.
* To use register names with standard convension, please use EVADC_G7_EMUXCS.
*/
#define EVADC_G7EMUXCS (EVADC_G7_EMUXCS)

