zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 2E94, Group 10 Result Control Register 5 */
#define EVADC_G10_RCR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E94u)
/** Alias (User Manual Name) for EVADC_G10_RCR5.
* To use register names with standard convension, please use EVADC_G10_RCR5.
*/
#define EVADC_G10RCR5 (EVADC_G10_RCR5)

/** \brief 2E98, Group 10 Result Control Register 6 */
#define EVADC_G10_RCR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E98u)
/** Alias (User Manual Name) for EVADC_G10_RCR6.
* To use register names with standard convension, please use EVADC_G10_RCR6.
*/
#define EVADC_G10RCR6 (EVADC_G10_RCR6)

/** \brief 2E9C, Group 10 Result Control Register 7 */
#define EVADC_G10_RCR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022E9Cu)
/** Alias (User Manual Name) for EVADC_G10_RCR7.
* To use register names with standard convension, please use EVADC_G10_RCR7.
*/
#define EVADC_G10RCR7 (EVADC_G10_RCR7)

/** \brief 2EA0, Group 10 Result Control Register 8 */
#define EVADC_G10_RCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EA0u)
/** Alias (User Manual Name) for EVADC_G10_RCR8.
* To use register names with standard convension, please use EVADC_G10_RCR8.
*/
#define EVADC_G10RCR8 (EVADC_G10_RCR8)

/** \brief 2EA4, Group 10 Result Control Register 9 */
#define EVADC_G10_RCR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EA4u)
/** Alias (User Manual Name) for EVADC_G10_RCR9.
* To use register names with standard convension, please use EVADC_G10_RCR9.
*/
#define EVADC_G10RCR9 (EVADC_G10_RCR9)

/** \brief 2EA8, Group 10 Result Control Register 10 */
#define EVADC_G10_RCR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EA8u)
/** Alias (User Manual Name) for EVADC_G10_RCR10.
* To use register names with standard convension, please use EVADC_G10_RCR10.
*/
#define EVADC_G10RCR10 (EVADC_G10_RCR10)

/** \brief 2EAC, Group 10 Result Control Register 11 */
#define EVADC_G10_RCR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EACu)
/** Alias (User Manual Name) for EVADC_G10_RCR11.
* To use register names with standard convension, please use EVADC_G10_RCR11.
*/
#define EVADC_G10RCR11 (EVADC_G10_RCR11)

/** \brief 2EB0, Group 10 Result Control Register 12 */
#define EVADC_G10_RCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EB0u)
/** Alias (User Manual Name) for EVADC_G10_RCR12.
* To use register names with standard convension, please use EVADC_G10_RCR12.
*/
#define EVADC_G10RCR12 (EVADC_G10_RCR12)

/** \brief 2EB4, Group 10 Result Control Register 13 */
#define EVADC_G10_RCR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EB4u)
/** Alias (User Manual Name) for EVADC_G10_RCR13.
* To use register names with standard convension, please use EVADC_G10_RCR13.
*/
#define EVADC_G10RCR13 (EVADC_G10_RCR13)

/** \brief 2EB8, Group 10 Result Control Register 14 */
#define EVADC_G10_RCR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EB8u)
/** Alias (User Manual Name) for EVADC_G10_RCR14.
* To use register names with standard convension, please use EVADC_G10_RCR14.
*/
#define EVADC_G10RCR14 (EVADC_G10_RCR14)

/** \brief 2EBC, Group 10 Result Control Register 15 */
#define EVADC_G10_RCR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022EBCu)
/** Alias (User Manual Name) for EVADC_G10_RCR15.
* To use register names with standard convension, please use EVADC_G10_RCR15.
*/
#define EVADC_G10RCR15 (EVADC_G10_RCR15)

/** \brief 2F00, Group 10 Result Register 0\n */
#define EVADC_G10_RES0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F00u)
/** Alias (User Manual Name) for EVADC_G10_RES0.
* To use register names with standard convension, please use EVADC_G10_RES0.
*/
#define EVADC_G10RES0 (EVADC_G10_RES0)

/** \brief 2F04, Group 10 Result Register 1\n */
#define EVADC_G10_RES1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F04u)
/** Alias (User Manual Name) for EVADC_G10_RES1.
* To use register names with standard convension, please use EVADC_G10_RES1.
*/
#define EVADC_G10RES1 (EVADC_G10_RES1)

/** \brief 2F08, Group 10 Result Register 2\n */
#define EVADC_G10_RES2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F08u)
/** Alias (User Manual Name) for EVADC_G10_RES2.
* To use register names with standard convension, please use EVADC_G10_RES2.
*/
#define EVADC_G10RES2 (EVADC_G10_RES2)

/** \brief 2F0C, Group 10 Result Register 3\n */
#define EVADC_G10_RES3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F0Cu)
/** Alias (User Manual Name) for EVADC_G10_RES3.
* To use register names with standard convension, please use EVADC_G10_RES3.
*/
#define EVADC_G10RES3 (EVADC_G10_RES3)

/** \brief 2F10, Group 10 Result Register 4\n */
#define EVADC_G10_RES4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F10u)
/** Alias (User Manual Name) for EVADC_G10_RES4.
* To use register names with standard convension, please use EVADC_G10_RES4.
*/
#define EVADC_G10RES4 (EVADC_G10_RES4)

/** \brief 2F14, Group 10 Result Register 5\n */
#define EVADC_G10_RES5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F14u)
/** Alias (User Manual Name) for EVADC_G10_RES5.
* To use register names with standard convension, please use EVADC_G10_RES5.
*/
#define EVADC_G10RES5 (EVADC_G10_RES5)

/** \brief 2F18, Group 10 Result Register 6\n */
#define EVADC_G10_RES6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F18u)
/** Alias (User Manual Name) for EVADC_G10_RES6.
* To use register names with standard convension, please use EVADC_G10_RES6.
*/
#define EVADC_G10RES6 (EVADC_G10_RES6)

/** \brief 2F1C, Group 10 Result Register 7\n */
#define EVADC_G10_RES7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F1Cu)
/** Alias (User Manual Name) for EVADC_G10_RES7.
* To use register names with standard convension, please use EVADC_G10_RES7.
*/
#define EVADC_G10RES7 (EVADC_G10_RES7)

/** \brief 2F20, Group 10 Result Register 8\n */
#define EVADC_G10_RES8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F20u)
/** Alias (User Manual Name) for EVADC_G10_RES8.
* To use register names with standard convension, please use EVADC_G10_RES8.
*/
#define EVADC_G10RES8 (EVADC_G10_RES8)

/** \brief 2F24, Group 10 Result Register 9\n */
#define EVADC_G10_RES9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F24u)
/** Alias (User Manual Name) for EVADC_G10_RES9.
* To use register names with standard convension, please use EVADC_G10_RES9.
*/
#define EVADC_G10RES9 (EVADC_G10_RES9)

/** \brief 2F28, Group 10 Result Register 10\n */
#define EVADC_G10_RES10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022F28u)
/** Alias (User Manual Name) for EVADC_G10_RES10.
* To use register names with standard convension, please use EVADC_G10_RES10.
*/
#define EVADC_G10RES10 (EVADC_G10_RES10)

