zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 3198, Source Event Flag Clear Reg., Group 11 */
#define EVADC_G11_SEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0023198u)
/** Alias (User Manual Name) for EVADC_G11_SEFCLR.
* To use register names with standard convension, please use EVADC_G11_SEFCLR.
*/
#define EVADC_G11SEFCLR (EVADC_G11_SEFCLR)

/** \brief 31A0, Channel Event Node Pointer Reg. 0, Group 11 */
#define EVADC_G11_CEVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF00231A0u)
/** Alias (User Manual Name) for EVADC_G11_CEVNP0.
* To use register names with standard convension, please use EVADC_G11_CEVNP0.
*/
#define EVADC_G11CEVNP0 (EVADC_G11_CEVNP0)

/** \brief 31A4, Channel Event Node Pointer Reg. 1, Group 11 */
#define EVADC_G11_CEVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP1*)0xF00231A4u)
/** Alias (User Manual Name) for EVADC_G11_CEVNP1.
* To use register names with standard convension, please use EVADC_G11_CEVNP1.
*/
#define EVADC_G11CEVNP1 (EVADC_G11_CEVNP1)

/** \brief 31B0, Result Event Node Pointer Reg. 0, Group 11 */
#define EVADC_G11_REVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF00231B0u)
/** Alias (User Manual Name) for EVADC_G11_REVNP0.
* To use register names with standard convension, please use EVADC_G11_REVNP0.
*/
#define EVADC_G11REVNP0 (EVADC_G11_REVNP0)

/** \brief 31B4, Result Event Node Pointer Reg. 1, Group 11 */
#define EVADC_G11_REVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF00231B4u)
/** Alias (User Manual Name) for EVADC_G11_REVNP1.
* To use register names with standard convension, please use EVADC_G11_REVNP1.
*/
#define EVADC_G11REVNP1 (EVADC_G11_REVNP1)

/** \brief 31C0, Source Event Node Pointer Reg., Group 11 */
#define EVADC_G11_SEVNP /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF00231C0u)
/** Alias (User Manual Name) for EVADC_G11_SEVNP.
* To use register names with standard convension, please use EVADC_G11_SEVNP.
*/
#define EVADC_G11SEVNP (EVADC_G11_SEVNP)

/** \brief 31C8, Service Request Software Activation Trigger, Group 11 */
#define EVADC_G11_SRACT /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF00231C8u)
/** Alias (User Manual Name) for EVADC_G11_SRACT.
* To use register names with standard convension, please use EVADC_G11_SRACT.
*/
#define EVADC_G11SRACT (EVADC_G11_SRACT)

/** \brief 31F0, External Multiplexer Control Reg., Group 11 */
#define EVADC_G11_EMUXCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF00231F0u)
/** Alias (User Manual Name) for EVADC_G11_EMUXCTR.
* To use register names with standard convension, please use EVADC_G11_EMUXCTR.
*/
#define EVADC_G11EMUXCTR (EVADC_G11_EMUXCTR)

/** \brief 31F4, Ext. Multiplexer Channel Select Reg., Group 11 */
#define EVADC_G11_EMUXCS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF00231F4u)
/** Alias (User Manual Name) for EVADC_G11_EMUXCS.
* To use register names with standard convension, please use EVADC_G11_EMUXCS.
*/
#define EVADC_G11EMUXCS (EVADC_G11_EMUXCS)

/** \brief 31F8, Valid Flag Register, Group 11 */
#define EVADC_G11_VFR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00231F8u)
/** Alias (User Manual Name) for EVADC_G11_VFR.
* To use register names with standard convension, please use EVADC_G11_VFR.
*/
#define EVADC_G11VFR (EVADC_G11_VFR)

/** \brief 3200, Group 11, Channel 0 Control Register */
#define EVADC_G11_CHCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023200u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR0.
* To use register names with standard convension, please use EVADC_G11_CHCTR0.
*/
#define EVADC_G11CHCTR0 (EVADC_G11_CHCTR0)

/** \brief 3204, Group 11, Channel 1 Control Register */
#define EVADC_G11_CHCTR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023204u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR1.
* To use register names with standard convension, please use EVADC_G11_CHCTR1.
*/
#define EVADC_G11CHCTR1 (EVADC_G11_CHCTR1)

/** \brief 3208, Group 11, Channel 2 Control Register */
#define EVADC_G11_CHCTR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023208u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR2.
* To use register names with standard convension, please use EVADC_G11_CHCTR2.
*/
#define EVADC_G11CHCTR2 (EVADC_G11_CHCTR2)

/** \brief 320C, Group 11, Channel 3 Control Register */
#define EVADC_G11_CHCTR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002320Cu)
/** Alias (User Manual Name) for EVADC_G11_CHCTR3.
* To use register names with standard convension, please use EVADC_G11_CHCTR3.
*/
#define EVADC_G11CHCTR3 (EVADC_G11_CHCTR3)

/** \brief 3210, Group 11, Channel 4 Control Register */
#define EVADC_G11_CHCTR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023210u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR4.
* To use register names with standard convension, please use EVADC_G11_CHCTR4.
*/
#define EVADC_G11CHCTR4 (EVADC_G11_CHCTR4)

/** \brief 3214, Group 11, Channel 5 Control Register */
#define EVADC_G11_CHCTR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023214u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR5.
* To use register names with standard convension, please use EVADC_G11_CHCTR5.
*/
#define EVADC_G11CHCTR5 (EVADC_G11_CHCTR5)

/** \brief 3218, Group 11, Channel 6 Control Register */
#define EVADC_G11_CHCTR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023218u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR6.
* To use register names with standard convension, please use EVADC_G11_CHCTR6.
*/
#define EVADC_G11CHCTR6 (EVADC_G11_CHCTR6)

/** \brief 321C, Group 11, Channel 7 Control Register */
#define EVADC_G11_CHCTR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002321Cu)
/** Alias (User Manual Name) for EVADC_G11_CHCTR7.
* To use register names with standard convension, please use EVADC_G11_CHCTR7.
*/
#define EVADC_G11CHCTR7 (EVADC_G11_CHCTR7)

/** \brief 3220, Group 11, Channel 8 Control Register */
#define EVADC_G11_CHCTR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023220u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR8.
* To use register names with standard convension, please use EVADC_G11_CHCTR8.
*/
#define EVADC_G11CHCTR8 (EVADC_G11_CHCTR8)

/** \brief 3224, Group 11, Channel 9 Control Register */
#define EVADC_G11_CHCTR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023224u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR9.
* To use register names with standard convension, please use EVADC_G11_CHCTR9.
*/
#define EVADC_G11CHCTR9 (EVADC_G11_CHCTR9)

/** \brief 3228, Group 11, Channel 10 Control Register */
#define EVADC_G11_CHCTR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023228u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR10.
* To use register names with standard convension, please use EVADC_G11_CHCTR10.
*/
#define EVADC_G11CHCTR10 (EVADC_G11_CHCTR10)

/** \brief 322C, Group 11, Channel 11 Control Register */
#define EVADC_G11_CHCTR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002322Cu)
/** Alias (User Manual Name) for EVADC_G11_CHCTR11.
* To use register names with standard convension, please use EVADC_G11_CHCTR11.
*/
#define EVADC_G11CHCTR11 (EVADC_G11_CHCTR11)

/** \brief 3230, Group 11, Channel 12 Control Register */
#define EVADC_G11_CHCTR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023230u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR12.
* To use register names with standard convension, please use EVADC_G11_CHCTR12.
*/
#define EVADC_G11CHCTR12 (EVADC_G11_CHCTR12)

/** \brief 3234, Group 11, Channel 13 Control Register */
#define EVADC_G11_CHCTR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023234u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR13.
* To use register names with standard convension, please use EVADC_G11_CHCTR13.
*/
#define EVADC_G11CHCTR13 (EVADC_G11_CHCTR13)

/** \brief 3238, Group 11, Channel 14 Control Register */
#define EVADC_G11_CHCTR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0023238u)
/** Alias (User Manual Name) for EVADC_G11_CHCTR14.
* To use register names with standard convension, please use EVADC_G11_CHCTR14.
*/
#define EVADC_G11CHCTR14 (EVADC_G11_CHCTR14)

/** \brief 323C, Group 11, Channel 15 Control Register */
#define EVADC_G11_CHCTR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002323Cu)
/** Alias (User Manual Name) for EVADC_G11_CHCTR15.
* To use register names with standard convension, please use EVADC_G11_CHCTR15.
*/
#define EVADC_G11CHCTR15 (EVADC_G11_CHCTR15)

/** \brief 3280, Group 11 Result Control Register 0 */
#define EVADC_G11_RCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0023280u)
/** Alias (User Manual Name) for EVADC_G11_RCR0.
* To use register names with standard convension, please use EVADC_G11_RCR0.
*/
#define EVADC_G11RCR0 (EVADC_G11_RCR0)

/** \brief 3284, Group 11 Result Control Register 1 */
#define EVADC_G11_RCR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0023284u)
/** Alias (User Manual Name) for EVADC_G11_RCR1.
* To use register names with standard convension, please use EVADC_G11_RCR1.
*/
#define EVADC_G11RCR1 (EVADC_G11_RCR1)

/** \brief 3288, Group 11 Result Control Register 2 */
#define EVADC_G11_RCR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0023288u)
/** Alias (User Manual Name) for EVADC_G11_RCR2.
* To use register names with standard convension, please use EVADC_G11_RCR2.
*/
#define EVADC_G11RCR2 (EVADC_G11_RCR2)

/** \brief 328C, Group 11 Result Control Register 3 */
#define EVADC_G11_RCR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF002328Cu)
/** Alias (User Manual Name) for EVADC_G11_RCR3.
* To use register names with standard convension, please use EVADC_G11_RCR3.
*/
#define EVADC_G11RCR3 (EVADC_G11_RCR3)

/** \brief 3290, Group 11 Result Control Register 4 */
#define EVADC_G11_RCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0023290u)
/** Alias (User Manual Name) for EVADC_G11_RCR4.
* To use register names with standard convension, please use EVADC_G11_RCR4.
*/
#define EVADC_G11RCR4 (EVADC_G11_RCR4)

/** \brief 3294, Group 11 Result Control Register 5 */
#define EVADC_G11_RCR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0023294u)
/** Alias (User Manual Name) for EVADC_G11_RCR5.
* To use register names with standard convension, please use EVADC_G11_RCR5.
*/
#define EVADC_G11RCR5 (EVADC_G11_RCR5)

/** \brief 3298, Group 11 Result Control Register 6 */
#define EVADC_G11_RCR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0023298u)
/** Alias (User Manual Name) for EVADC_G11_RCR6.
* To use register names with standard convension, please use EVADC_G11_RCR6.
*/
#define EVADC_G11RCR6 (EVADC_G11_RCR6)

