zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 3500, Fast Compare Control Register, FC Channel 1 */
#define EVADC_FC1_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023500u)
/** Alias (User Manual Name) for EVADC_FC1_FCCTRL.
* To use register names with standard convension, please use EVADC_FC1_FCCTRL.
*/
#define EVADC_FC1FCCTRL (EVADC_FC1_FCCTRL)

/** \brief 3504, Fast Compare Mode Register, FC Channel 1 */
#define EVADC_FC1_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023504u)
/** Alias (User Manual Name) for EVADC_FC1_FCM.
* To use register names with standard convension, please use EVADC_FC1_FCM.
*/
#define EVADC_FC1FCM (EVADC_FC1_FCM)

/** \brief 3508, Fast Compare Ramp Register 0, FC Channel 1 */
#define EVADC_FC1_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023508u)
/** Alias (User Manual Name) for EVADC_FC1_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC1_FCRAMP0.
*/
#define EVADC_FC1FCRAMP0 (EVADC_FC1_FCRAMP0)

/** \brief 350C, Fast Compare Ramp Register 1, FC Channel 1 */
#define EVADC_FC1_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF002350Cu)
/** Alias (User Manual Name) for EVADC_FC1_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC1_FCRAMP1.
*/
#define EVADC_FC1FCRAMP1 (EVADC_FC1_FCRAMP1)

/** \brief 3520, Boundary Flag Register, FC Channel 1 */
#define EVADC_FC1_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023520u)
/** Alias (User Manual Name) for EVADC_FC1_FCBFL.
* To use register names with standard convension, please use EVADC_FC1_FCBFL.
*/
#define EVADC_FC1FCBFL (EVADC_FC1_FCBFL)

/** \brief 3524, Fast Comp. Hysteresis Register, FC Channel 1 */
#define EVADC_FC1_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023524u)
/** Alias (User Manual Name) for EVADC_FC1_FCHYST.
* To use register names with standard convension, please use EVADC_FC1_FCHYST.
*/
#define EVADC_FC1FCHYST (EVADC_FC1_FCHYST)

/** \brief 3600, Fast Compare Control Register, FC Channel 2 */
#define EVADC_FC2_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023600u)
/** Alias (User Manual Name) for EVADC_FC2_FCCTRL.
* To use register names with standard convension, please use EVADC_FC2_FCCTRL.
*/
#define EVADC_FC2FCCTRL (EVADC_FC2_FCCTRL)

/** \brief 3604, Fast Compare Mode Register, FC Channel 2 */
#define EVADC_FC2_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023604u)
/** Alias (User Manual Name) for EVADC_FC2_FCM.
* To use register names with standard convension, please use EVADC_FC2_FCM.
*/
#define EVADC_FC2FCM (EVADC_FC2_FCM)

/** \brief 3608, Fast Compare Ramp Register 0, FC Channel 2 */
#define EVADC_FC2_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023608u)
/** Alias (User Manual Name) for EVADC_FC2_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC2_FCRAMP0.
*/
#define EVADC_FC2FCRAMP0 (EVADC_FC2_FCRAMP0)

/** \brief 360C, Fast Compare Ramp Register 1, FC Channel 2 */
#define EVADC_FC2_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF002360Cu)
/** Alias (User Manual Name) for EVADC_FC2_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC2_FCRAMP1.
*/
#define EVADC_FC2FCRAMP1 (EVADC_FC2_FCRAMP1)

/** \brief 3620, Boundary Flag Register, FC Channel 2 */
#define EVADC_FC2_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023620u)
/** Alias (User Manual Name) for EVADC_FC2_FCBFL.
* To use register names with standard convension, please use EVADC_FC2_FCBFL.
*/
#define EVADC_FC2FCBFL (EVADC_FC2_FCBFL)

/** \brief 3624, Fast Comp. Hysteresis Register, FC Channel 2 */
#define EVADC_FC2_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023624u)
/** Alias (User Manual Name) for EVADC_FC2_FCHYST.
* To use register names with standard convension, please use EVADC_FC2_FCHYST.
*/
#define EVADC_FC2FCHYST (EVADC_FC2_FCHYST)

/** \brief 3700, Fast Compare Control Register, FC Channel 3 */
#define EVADC_FC3_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023700u)
/** Alias (User Manual Name) for EVADC_FC3_FCCTRL.
* To use register names with standard convension, please use EVADC_FC3_FCCTRL.
*/
#define EVADC_FC3FCCTRL (EVADC_FC3_FCCTRL)

/** \brief 3704, Fast Compare Mode Register, FC Channel 3 */
#define EVADC_FC3_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023704u)
/** Alias (User Manual Name) for EVADC_FC3_FCM.
* To use register names with standard convension, please use EVADC_FC3_FCM.
*/
#define EVADC_FC3FCM (EVADC_FC3_FCM)

/** \brief 3708, Fast Compare Ramp Register 0, FC Channel 3 */
#define EVADC_FC3_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023708u)
/** Alias (User Manual Name) for EVADC_FC3_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC3_FCRAMP0.
*/
#define EVADC_FC3FCRAMP0 (EVADC_FC3_FCRAMP0)

/** \brief 370C, Fast Compare Ramp Register 1, FC Channel 3 */
#define EVADC_FC3_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF002370Cu)
/** Alias (User Manual Name) for EVADC_FC3_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC3_FCRAMP1.
*/
#define EVADC_FC3FCRAMP1 (EVADC_FC3_FCRAMP1)

/** \brief 3720, Boundary Flag Register, FC Channel 3 */
#define EVADC_FC3_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023720u)
/** Alias (User Manual Name) for EVADC_FC3_FCBFL.
* To use register names with standard convension, please use EVADC_FC3_FCBFL.
*/
#define EVADC_FC3FCBFL (EVADC_FC3_FCBFL)

/** \brief 3724, Fast Comp. Hysteresis Register, FC Channel 3 */
#define EVADC_FC3_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023724u)
/** Alias (User Manual Name) for EVADC_FC3_FCHYST.
* To use register names with standard convension, please use EVADC_FC3_FCHYST.
*/
#define EVADC_FC3FCHYST (EVADC_FC3_FCHYST)

/** \brief 3800, Fast Compare Control Register, FC Channel 4 */
#define EVADC_FC4_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023800u)
/** Alias (User Manual Name) for EVADC_FC4_FCCTRL.
* To use register names with standard convension, please use EVADC_FC4_FCCTRL.
*/
#define EVADC_FC4FCCTRL (EVADC_FC4_FCCTRL)

/** \brief 3804, Fast Compare Mode Register, FC Channel 4 */
#define EVADC_FC4_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023804u)
/** Alias (User Manual Name) for EVADC_FC4_FCM.
* To use register names with standard convension, please use EVADC_FC4_FCM.
*/
#define EVADC_FC4FCM (EVADC_FC4_FCM)

/** \brief 3808, Fast Compare Ramp Register 0, FC Channel 4 */
#define EVADC_FC4_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023808u)
/** Alias (User Manual Name) for EVADC_FC4_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC4_FCRAMP0.
*/
#define EVADC_FC4FCRAMP0 (EVADC_FC4_FCRAMP0)

