zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEvadc_reg.h
/** \brief 380C, Fast Compare Ramp Register 1, FC Channel 4 */
#define EVADC_FC4_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF002380Cu)
/** Alias (User Manual Name) for EVADC_FC4_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC4_FCRAMP1.
*/
#define EVADC_FC4FCRAMP1 (EVADC_FC4_FCRAMP1)

/** \brief 3820, Boundary Flag Register, FC Channel 4 */
#define EVADC_FC4_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023820u)
/** Alias (User Manual Name) for EVADC_FC4_FCBFL.
* To use register names with standard convension, please use EVADC_FC4_FCBFL.
*/
#define EVADC_FC4FCBFL (EVADC_FC4_FCBFL)

/** \brief 3824, Fast Comp. Hysteresis Register, FC Channel 4 */
#define EVADC_FC4_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023824u)
/** Alias (User Manual Name) for EVADC_FC4_FCHYST.
* To use register names with standard convension, please use EVADC_FC4_FCHYST.
*/
#define EVADC_FC4FCHYST (EVADC_FC4_FCHYST)

/** \brief 3900, Fast Compare Control Register, FC Channel 5 */
#define EVADC_FC5_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023900u)
/** Alias (User Manual Name) for EVADC_FC5_FCCTRL.
* To use register names with standard convension, please use EVADC_FC5_FCCTRL.
*/
#define EVADC_FC5FCCTRL (EVADC_FC5_FCCTRL)

/** \brief 3904, Fast Compare Mode Register, FC Channel 5 */
#define EVADC_FC5_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023904u)
/** Alias (User Manual Name) for EVADC_FC5_FCM.
* To use register names with standard convension, please use EVADC_FC5_FCM.
*/
#define EVADC_FC5FCM (EVADC_FC5_FCM)

/** \brief 3908, Fast Compare Ramp Register 0, FC Channel 5 */
#define EVADC_FC5_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023908u)
/** Alias (User Manual Name) for EVADC_FC5_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC5_FCRAMP0.
*/
#define EVADC_FC5FCRAMP0 (EVADC_FC5_FCRAMP0)

/** \brief 390C, Fast Compare Ramp Register 1, FC Channel 5 */
#define EVADC_FC5_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF002390Cu)
/** Alias (User Manual Name) for EVADC_FC5_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC5_FCRAMP1.
*/
#define EVADC_FC5FCRAMP1 (EVADC_FC5_FCRAMP1)

/** \brief 3920, Boundary Flag Register, FC Channel 5 */
#define EVADC_FC5_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023920u)
/** Alias (User Manual Name) for EVADC_FC5_FCBFL.
* To use register names with standard convension, please use EVADC_FC5_FCBFL.
*/
#define EVADC_FC5FCBFL (EVADC_FC5_FCBFL)

/** \brief 3924, Fast Comp. Hysteresis Register, FC Channel 5 */
#define EVADC_FC5_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023924u)
/** Alias (User Manual Name) for EVADC_FC5_FCHYST.
* To use register names with standard convension, please use EVADC_FC5_FCHYST.
*/
#define EVADC_FC5FCHYST (EVADC_FC5_FCHYST)

/** \brief 3A00, Fast Compare Control Register, FC Channel 6 */
#define EVADC_FC6_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023A00u)
/** Alias (User Manual Name) for EVADC_FC6_FCCTRL.
* To use register names with standard convension, please use EVADC_FC6_FCCTRL.
*/
#define EVADC_FC6FCCTRL (EVADC_FC6_FCCTRL)

/** \brief 3A04, Fast Compare Mode Register, FC Channel 6 */
#define EVADC_FC6_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023A04u)
/** Alias (User Manual Name) for EVADC_FC6_FCM.
* To use register names with standard convension, please use EVADC_FC6_FCM.
*/
#define EVADC_FC6FCM (EVADC_FC6_FCM)

/** \brief 3A08, Fast Compare Ramp Register 0, FC Channel 6 */
#define EVADC_FC6_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023A08u)
/** Alias (User Manual Name) for EVADC_FC6_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC6_FCRAMP0.
*/
#define EVADC_FC6FCRAMP0 (EVADC_FC6_FCRAMP0)

/** \brief 3A0C, Fast Compare Ramp Register 1, FC Channel 6 */
#define EVADC_FC6_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF0023A0Cu)
/** Alias (User Manual Name) for EVADC_FC6_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC6_FCRAMP1.
*/
#define EVADC_FC6FCRAMP1 (EVADC_FC6_FCRAMP1)

/** \brief 3A20, Boundary Flag Register, FC Channel 6 */
#define EVADC_FC6_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023A20u)
/** Alias (User Manual Name) for EVADC_FC6_FCBFL.
* To use register names with standard convension, please use EVADC_FC6_FCBFL.
*/
#define EVADC_FC6FCBFL (EVADC_FC6_FCBFL)

/** \brief 3A24, Fast Comp. Hysteresis Register, FC Channel 6 */
#define EVADC_FC6_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023A24u)
/** Alias (User Manual Name) for EVADC_FC6_FCHYST.
* To use register names with standard convension, please use EVADC_FC6_FCHYST.
*/
#define EVADC_FC6FCHYST (EVADC_FC6_FCHYST)

/** \brief 3B00, Fast Compare Control Register, FC Channel 7 */
#define EVADC_FC7_FCCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCCTRL*)0xF0023B00u)
/** Alias (User Manual Name) for EVADC_FC7_FCCTRL.
* To use register names with standard convension, please use EVADC_FC7_FCCTRL.
*/
#define EVADC_FC7FCCTRL (EVADC_FC7_FCCTRL)

/** \brief 3B04, Fast Compare Mode Register, FC Channel 7 */
#define EVADC_FC7_FCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCM*)0xF0023B04u)
/** Alias (User Manual Name) for EVADC_FC7_FCM.
* To use register names with standard convension, please use EVADC_FC7_FCM.
*/
#define EVADC_FC7FCM (EVADC_FC7_FCM)

/** \brief 3B08, Fast Compare Ramp Register 0, FC Channel 7 */
#define EVADC_FC7_FCRAMP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP0*)0xF0023B08u)
/** Alias (User Manual Name) for EVADC_FC7_FCRAMP0.
* To use register names with standard convension, please use EVADC_FC7_FCRAMP0.
*/
#define EVADC_FC7FCRAMP0 (EVADC_FC7_FCRAMP0)

/** \brief 3B0C, Fast Compare Ramp Register 1, FC Channel 7 */
#define EVADC_FC7_FCRAMP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCRAMP1*)0xF0023B0Cu)
/** Alias (User Manual Name) for EVADC_FC7_FCRAMP1.
* To use register names with standard convension, please use EVADC_FC7_FCRAMP1.
*/
#define EVADC_FC7FCRAMP1 (EVADC_FC7_FCRAMP1)

/** \brief 3B20, Boundary Flag Register, FC Channel 7 */
#define EVADC_FC7_FCBFL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCBFL*)0xF0023B20u)
/** Alias (User Manual Name) for EVADC_FC7_FCBFL.
* To use register names with standard convension, please use EVADC_FC7_FCBFL.
*/
#define EVADC_FC7FCBFL (EVADC_FC7_FCBFL)

/** \brief 3B24, Fast Comp. Hysteresis Register, FC Channel 7 */
#define EVADC_FC7_FCHYST /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_FC_FCHYST*)0xF0023B24u)
/** Alias (User Manual Name) for EVADC_FC7_FCHYST.
* To use register names with standard convension, please use EVADC_FC7_FCHYST.
*/
#define EVADC_FC7FCHYST (EVADC_FC7_FCHYST)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEVADC_REG_H */
